Yang-S-K/smartFan/Code/STM32/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "servo.h"
#include "motor.h"
#include "ESP32.h"
#include "temperature.h"
#include "lcd1602_i2c.h"
#include "keypad.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>


/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

I2C_HandleTypeDef hi2c1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim5;

UART_HandleTypeDef huart3;
UART_HandleTypeDef huart6;

PCD_HandleTypeDef hpcd_USB_OTG_FS;

/* USER CODE BEGIN PV */
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USB_OTG_FS_PCD_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM1_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_I2C1_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM5_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
char str[256];
char strC1[17];
char strC2[17];

int PIR_Flags=1;
volatile uint8_t bitCount = 0;
volatile uint8_t isStartCaptured = 0;
volatile uint32_t receivedData = 0;
static volatile uint32_t IC_Value = 0;
char ir_value = 'N';
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART3_UART_Init();
  MX_USB_OTG_FS_PCD_Init();
  MX_ADC1_Init();
  MX_TIM1_Init();
  MX_USART6_UART_Init();
  MX_TIM2_Init();
  MX_I2C1_Init();
  MX_TIM4_Init();
  MX_TIM5_Init();
  /* USER CODE BEGIN 2 */
  HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_3);
  HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_4);
  HAL_TIM_Base_Start_IT(&htim2);
  HAL_TIM_IC_Start_IT(&htim5, TIM_CHANNEL_1);
  Motor_Init(&htim1);
  Keypad_Init();
  Calibrate_Servo_Zero();
  HAL_ADC_Start(&hadc1);
  LCD_Init();
  LCD_Clear();
  uint32_t lastUpdate = 0; //  ?????? ?  ? ?????? ?次更?  ??  ??
  int oldFanState = -1,oldFanSpeed = -1,oldFanhAngle = -1,oldFanvAngle = -1;
  float temperature = ADC1_temperature(),oldtemperature=25;
  int hAngle_state=0,vAngle_state=0,hAngle=0,vAngle=0,hstep=1,vstep=1;
  char tempKey='N';
  static uint32_t lastIRProcessTick = 0;

//  FanData fanStatus = ESP32_GetFanData();
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */



//	  temperature = Get_Temperature(); // ??????????30秒更?  溫度

	  temperature = ADC1_temperature(); //?  ?? ?  ?  溫度
	  ESP32_UART_Receive(); //??  ? ESP32??  ??
	  FanData fanStatus = ESP32_GetFanData();

	  if(HAL_GPIO_ReadPin(USER_Btn_GPIO_Port, USER_Btn_Pin)==1){//STM32 ?????? ?  ?  ???????
    	  fanStatus.fanState = !fanStatus.fanState;
	  }


	  if(PIR_Flags==0){//PIR??  ? ?   ?  人自??  ?  ?  ?????????
		  fanStatus.fanState=0;
	  }

	  if(fanStatus.fanState==0){//?  ?? State?  ?   ?????? ??
		  Motor_Stop();
	  }else{
		  if(fanStatus.fanState>1){
			  fanStatus.fanState=1;
		  }
		  Motor_SetSpeed(fanStatus.fanSpeed);
	  }

	  //?  顆伺??  ????????  ?  ???????  ?
	  if(hAngle_state){
		  if (hAngle >= 100) {
		      hAngle = 100;
		      hstep = -5;
		  } else if (hAngle <= 0) {
		      hAngle = 0;
		      hstep = 5;
		  }
		  hAngle+=hstep;
		  fanStatus.hAngle=hAngle;
		  Set_Servo_Angle((int)(fanStatus.hAngle*1.8),360);
	  }else{
		  Set_Servo_Angle((int)(fanStatus.hAngle*1.8),360);
		  hAngle=fanStatus.hAngle;
	  }
	  if(vAngle_state){
		  if (vAngle >= 100) {
		      vAngle = 100;
		      vstep = -5;
		  } else if (hAngle <= 0) {
		      vAngle = 0;
		      vstep = 5;
		  }
		  vAngle+=vstep;
		  fanStatus.vAngle=vAngle;
		  Set_Servo_Angle((int)(fanStatus.vAngle*0.9),180);
	  }else{
		  Set_Servo_Angle((int)(fanStatus.vAngle*0.9),180);
		  vAngle=fanStatus.vAngle;
	  }

	  char key = Keypad_Scan();
	  if (key) {
		  tempKey=key;
		  switch (key) {
			  case 'A':
				  fanStatus.fanState = !fanStatus.fanState;
				  break;
			  case '3':
				  if(fanStatus.fanSpeed<=0){
					  fanStatus.fanSpeed=0;
				  }else{
					  fanStatus.fanSpeed-=10;
				  }
				  break;
			  case '2':
				  fanStatus.fanSpeed=50;
				  break;
			  case '1':
				  if(fanStatus.fanSpeed>=100){
					  fanStatus.fanSpeed=100;
				  }else{
					  fanStatus.fanSpeed+=10;
				  }
				  break;

			  case 'B':
				  hAngle_state = !hAngle_state;
				  break;
			  case '6':
				  hAngle_state=0;
				  if(fanStatus.hAngle<=0){
					  fanStatus.hAngle=0;
				  }else{
					  fanStatus.hAngle-=10;
				  }
				  break;
			  case '5':
				  hAngle_state=0;
				  fanStatus.hAngle=50;
				  break;
			  case '4':
				  hAngle_state=0;
				  if(fanStatus.hAngle>=100){
					  fanStatus.hAngle=100;
				  }else{
					  fanStatus.hAngle+=10;
				  }
				  break;

