Yang-S-K/smartFan/Code/STM32/main.c
			  case 'C':
				  vAngle_state = !vAngle_state;
				  break;
			  case '9':
				  vAngle_state=0;
				  if(fanStatus.vAngle<=0){
					  fanStatus.vAngle=0;
				  }else{
					  fanStatus.vAngle-=10;
				  }
				  break;
			  case '8':
				  vAngle_state=0;
				  fanStatus.vAngle=50;
				  break;
			  case '7':
				  vAngle_state=0;
				  if(fanStatus.vAngle>=100){
					  fanStatus.vAngle=100;
				  }else{
					  fanStatus.vAngle+=10;
				  }
				  break;
			  default:
				  break;
		  }
	  }
	  if (32 <= bitCount){
		  if (((receivedData>>16) & 0xFF) == ((~(receivedData>>24)) & 0xFF)){
			switch(receivedData) {
				case 0xB946FF00:  // up
					ir_value = 'U';
					  vAngle_state=0;
					  if(fanStatus.vAngle>=100){
						  fanStatus.vAngle=100;
					  }else{
						  fanStatus.vAngle+=10;
					  }
					break;
				case 0xEA15FF00:  // down
					ir_value = 'D';
					  vAngle_state=0;
					  if(fanStatus.vAngle<=0){
						  fanStatus.vAngle=0;
					  }else{
						  fanStatus.vAngle-=10;
					  }
					break;
				case 0xBB44FF00:  // left
					ir_value = 'L';
					  hAngle_state=0;
					  if(fanStatus.hAngle<=0){
						  fanStatus.hAngle=0;
					  }else{
						  fanStatus.hAngle-=10;
					  }
					break;
				case 0xBC43FF00:  // right
					ir_value = 'R';
					  hAngle_state=0;
					  if(fanStatus.hAngle>=100){
						  fanStatus.hAngle=100;
					  }else{
						  fanStatus.hAngle+=10;
					  }
					break;
				case 0xBF40FF00:  // OK
					ir_value = 'O';
					  fanStatus.fanState = !fanStatus.fanState;
					break;
				case 0xE916FF00:
					ir_value = '1';
					fanStatus.fanSpeed=10;
					break;
				case 0xE619FF00:
					ir_value = '2';
					fanStatus.fanSpeed=20;
					break;
				case 0xF20DFF00:
					ir_value = '3';
					fanStatus.fanSpeed=30;
					break;
				case 0xF30CFF00:
					ir_value = '4';
					fanStatus.fanSpeed=40;
					break;
				case 0xE718FF00:
					ir_value = '5';
					fanStatus.fanSpeed=50;
					break;
				case 0xA15EFF00:
					ir_value = '6';
					fanStatus.fanSpeed=60;
					break;
				case 0xF708FF00:
					ir_value = '7';
					fanStatus.fanSpeed=70;
					break;
				case 0xE31CFF00:
					ir_value = '8';
					fanStatus.fanSpeed=80;
					break;
				case 0xA55AFF00:
					ir_value = '9';
					fanStatus.fanSpeed=90;
					break;
				case 0xAD52FF00:
					ir_value = '0';
					fanStatus.fanSpeed=100;
					break;
				case 0xBD42FF00:
					ir_value = '*';
					  hAngle_state = !hAngle_state;
					break;
				case 0xB54AFF00:
					ir_value = '#';
					  vAngle_state = !vAngle_state;
					break;
				default:
					ir_value = 'N';  // ?   ?????? ?  ? ?  
					break;
			}
		  }else{
			  ir_value='N';
		  }
		    HAL_TIM_IC_Stop_IT(&htim5, TIM_CHANNEL_1);
		    __HAL_TIM_CLEAR_IT(&htim5, TIM_IT_CC1);
		    __HAL_TIM_CLEAR_FLAG(&htim5, TIM_FLAG_CC1);
		    __HAL_TIM_SET_COUNTER(&htim5, 0);
		    bitCount = 0;
		    receivedData = 0;
		    isStartCaptured = 0;

		    // 等 ?? 100ms ??  ? 許下 ?次解 ?
		    lastIRProcessTick = HAL_GetTick();

		  HAL_TIM_IC_Start_IT(&htim5, TIM_CHANNEL_1);                // ?? 新??  ? 中?  

//	  		if (ir_value != '\0') {
//	  		  	sprintf(str,"IR char: %c\r\n", ir_value);
//	  		  	HAL_UART_Transmit(&huart3, (uint8_t*)str, strlen(str), 100);
//	  		}
	  }
	  if ((HAL_GetTick() - lastIRProcessTick) > 100) {
	      if (bitCount == 0 && isStartCaptured == 0) {
	          HAL_TIM_IC_Start_IT(&htim5, TIM_CHANNEL_1);
	      }
	  }
	  //??  ?  ? ?  ?  ??  ? ?  給ESP32
      if (fanStatus.fanState != oldFanState||fanStatus.fanSpeed != oldFanSpeed||fanStatus.hAngle != oldFanhAngle||fanStatus.vAngle != oldFanvAngle||oldtemperature!=temperature) {  // **?  ?  ?? ?   ?????? ? ?  ??**
          SendDataToESP32(fanStatus.fanState, fanStatus.fanSpeed, fanStatus.hAngle, fanStatus.vAngle,temperature);
          oldFanState = fanStatus.fanState;
          oldFanSpeed = fanStatus.fanSpeed;
          oldFanhAngle = fanStatus.hAngle;
          oldFanvAngle = fanStatus.vAngle;
          oldtemperature = temperature;
      }

      //AccessPort顯示
//      sprintf(str,"State: %d Speed: %d%%\n hAngle_state: %d hAngle: %d vAngle_state: %d vAngle: %d\n T: %f ",fanStatus.fanState,fanStatus.fanSpeed,hAngle_state,(int)(fanStatus.hAngle*1.8),vAngle_state,(int)(fanStatus.vAngle*0.9),temperature);
//	  HAL_UART_Transmit(&huart3, (uint8_t*)str, strlen(str), 300);
//      sprintf(str,"tempKey: %c PIR_Flags: %d IR: %c\n \n",tempKey,PIR_Flags,ir_value);
//	  HAL_UART_Transmit(&huart3, (uint8_t*)str, strlen(str), 300);
      sprintf(str,
        "=========\r\n"
        "| State        : %d\r\n"
        "| Speed        : %d %%\r\n"
        "| hAngle_state : %d\r\n"
        "| hAngle       : %d\r\n"
        "| vAngle_state : %d\r\n"
        "| vAngle       : %d\r\n"
        "| Temperature  : %.2f\r\n"
        "| tempKey      : %c\r\n"
        "| PIR_Flags    : %d\r\n"
        "| IR           : %c\r\n"
        "=========\r\n",
        fanStatus.fanState,
        fanStatus.fanSpeed,
        hAngle_state,
        (int)(fanStatus.hAngle * 1.8),
        vAngle_state,
        (int)(fanStatus.vAngle * 0.9),
        temperature,
        tempKey,
        PIR_Flags,
        ir_value
      );
      HAL_UART_Transmit(&huart3, (uint8_t*)str, strlen(str), HAL_MAX_DELAY);

      if (HAL_GetTick() - lastUpdate >= 500) {
          lastUpdate = HAL_GetTick();
//          LCD_Clear();

          sprintf(strC1, "F%dS%3d T%2d P%dR%c",
                  fanStatus.fanState,
                  fanStatus.fanSpeed,
                  (int)temperature,
                  PIR_Flags,
                  ir_value);
          sprintf(strC1 + strlen(strC1), "%*s", 16 - strlen(strC1), "");
          LCD_SetCursor(0, 0);
          LCD_Print(strC1);

          sprintf(strC2, "h%d%3d v%d%3d K%c",
                  hAngle_state,
                  (int)(fanStatus.hAngle * 1.8),
                  vAngle_state,
                  (int)(fanStatus.vAngle * 0.9),
                  tempKey);
          sprintf(strC2 + strlen(strC2), "%*s", 16 - strlen(strC2), "");
          LCD_SetCursor(1, 0);
          LCD_Print(strC2);
      }
//	  memset(str, 0, sizeof(str));
//	  memset(strC1, 0, sizeof(strC1));
//	  memset(strC2, 0, sizeof(strC2));
//            */
	  HAL_Delay(500);



